import os

# Пытаемся взять токен из переменных окружения (Railway), иначе берем жестко заданный
BOT_TOKEN = os.getenv('BOT_TOKEN', '8212929038:AAEJ_P_Ttiy8-nrf1W2KfOqxQDiJNY1MlGk')

# ID главного админа (вставь свой цифровой ID, можно узнать у @userinfobot, или оставь ник для проверки в коде)
MAIN_ADMIN_USERNAME = 'SIavyanln' 

# Валюты для старых функций
TICKERS = {
    '💵 USDT': 'USDT-USD', '🇺🇸 USD': 'DX-Y.NYB', '₿ BTC': 'BTC-USD',
    '💎 ETH': 'ETH-USD', '💎 TON': 'TON11419-USD', '🇷🇺 RUB': 'RUB=X',
    '🇰🇬 KGS': 'KGS=X', '🇨🇳 CNY': 'CNY=X'
}
